470Statico/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../data"
dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.5;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
	type		fixedValue;
	value		$internalField;
    }

    outlet
    {
       type            inletOutlet;
       inletValue      $internalField;
       value           $internalField;
    }

    atmosphere
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    hull
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    left
    {
        type            zeroGradient;
    }

    right
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
